{"class_name": "Sequential", "keras_version": "2.0.3", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_1", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "dtype": "float32", "batch_input_shape": [null, 48, 48, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "name": "conv2d_2", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "name": "conv2d_3", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "data_format": "channels_last", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.48, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.48, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "trainable": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}]}