{"keras_version": "2.0.4", "config": {"output_layers": [["add_1", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 1]}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"sparse": false, "dtype": "float32", "name": "input_2", "batch_input_shape": [null, 1]}, "name": "input_2", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"input_dim": 6041, "dtype": "int32", "trainable": true, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "mask_zero": false, "input_length": 1, "batch_input_shape": [null, 1], "name": "embedding_1", "output_dim": 8, "activity_regularizer": null, "embeddings_regularizer": null}, "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"input_dim": 3953, "dtype": "int32", "trainable": true, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "mask_zero": false, "input_length": 1, "batch_input_shape": [null, 1], "name": "embedding_2", "output_dim": 8, "activity_regularizer": null, "embeddings_regularizer": null}, "name": "embedding_2", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}, "name": "flatten_2", "inbound_nodes": [[["embedding_2", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"input_dim": 6041, "dtype": "int32", "trainable": true, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "mask_zero": false, "input_length": 1, "batch_input_shape": [null, 1], "name": "embedding_3", "output_dim": 1, "activity_regularizer": null, "embeddings_regularizer": null}, "name": "embedding_3", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"input_dim": 3953, "dtype": "int32", "trainable": true, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "mask_zero": false, "input_length": 1, "batch_input_shape": [null, 1], "name": "embedding_4", "output_dim": 1, "activity_regularizer": null, "embeddings_regularizer": null}, "name": "embedding_4", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "Dot", "config": {"normalize": false, "axes": -1, "trainable": true, "name": "dot_1"}, "name": "dot_1", "inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_3"}, "name": "flatten_3", "inbound_nodes": [[["embedding_3", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_4"}, "name": "flatten_4", "inbound_nodes": [[["embedding_4", 0, 0, {}]]]}, {"class_name": "Add", "config": {"trainable": true, "name": "add_1"}, "name": "add_1", "inbound_nodes": [[["dot_1", 0, 0, {}], ["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}