{"config": [{"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 48, 48, 1], "kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "strides": [1, 1], "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "padding": "valid", "kernel_size": [3, 3], "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "kernel_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "padding": "valid", "trainable": true, "bias_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "units": 512, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.48}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "units": 256, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.48}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "units": 7, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "trainable": true, "bias_regularizer": null, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}], "class_name": "Sequential", "keras_version": "2.0.3", "backend": "tensorflow"}