{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"dtype": "int32", "trainable": false, "mask_zero": false, "output_dim": 50, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "embeddings_regularizer": null, "embeddings_constraint": null, "input_dim": 3000, "input_length": 50, "name": "embedding_1", "batch_input_shape": [null, 50], "activity_regularizer": null}}, {"class_name": "LSTM", "config": {"recurrent_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "tanh", "stateful": false, "kernel_regularizer": null, "recurrent_dropout": 0.2, "use_bias": true, "bias_constraint": null, "name": "lstm_1", "units": 128, "recurrent_constraint": null, "trainable": true, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "bias_regularizer": null, "activity_regularizer": null, "unroll": false, "dropout": 0.2}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "units": 64, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "units": 38, "activity_regularizer": null}}], "keras_version": "2.0.4"}