{"backend": "tensorflow", "keras_version": "2.0.3", "config": [{"config": {"name": "conv2d_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "bias_constraint": null, "dtype": "float32", "use_bias": true, "filters": 64, "batch_input_shape": [null, 48, 48, 1], "strides": [1, 1], "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "linear", "kernel_regularizer": null, "activity_regularizer": null, "padding": "valid", "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_2", "use_bias": true, "filters": 64, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_3", "use_bias": true, "filters": 64, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_4", "use_bias": true, "filters": 64, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "name": "conv2d_5", "use_bias": true, "filters": 64, "trainable": true, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "kernel_regularizer": null, "padding": "valid", "activity_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "rate": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "units": 512, "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "rate": 0.48, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "units": 256, "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "rate": 0.48, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "units": 7, "trainable": true, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}