{"class_name": "Sequential", "keras_version": "2.0.3", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "strides": [1, 1], "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "conv2d_1", "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "filters": 64, "batch_input_shape": [null, 48, 48, 1], "data_format": "channels_last", "bias_constraint": null, "dtype": "float32"}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "center": true, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "name": "conv2d_2", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "filters": 64, "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "center": true, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"activity_regularizer": null, "name": "conv2d_3", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3], "filters": 64, "data_format": "channels_last", "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 1, "center": true, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 512, "name": "dense_1", "activation": "linear", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.48}}, {"class_name": "Dense", "config": {"units": 256, "name": "dense_2", "activation": "linear", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "sigmoid"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.48}}, {"class_name": "Dense", "config": {"units": 7, "name": "dense_3", "activation": "linear", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "softmax"}}]}