{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.4", "config": {"output_layers": [["add_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_5", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "name": "input_5", "sparse": false}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_6", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "name": "input_6", "sparse": false}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, 21], "dtype": "float32", "name": "input_2", "sparse": false}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_4", "config": {"batch_input_shape": [null, 18], "dtype": "float32", "name": "input_4", "sparse": false}}, {"inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_1", "config": {"input_dim": 6041, "dtype": "int32", "name": "embedding_1", "output_dim": 8, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "trainable": true, "mask_zero": false, "input_length": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "batch_input_shape": [null, 1]}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_2", "config": {"input_dim": 3953, "dtype": "int32", "name": "embedding_2", "output_dim": 8, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "trainable": true, "mask_zero": false, "input_length": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "batch_input_shape": [null, 1]}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "units": 8, "activity_regularizer": null, "name": "dense_1", "activation": "linear", "kernel_regularizer": null}}, {"inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "units": 8, "activity_regularizer": null, "name": "dense_2", "activation": "linear", "kernel_regularizer": null}}, {"inbound_nodes": [[["embedding_1", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["embedding_2", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "name": "input_1", "sparse": false}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "input_3", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "name": "input_3", "sparse": false}}, {"inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_2", 0, 0, {}]]], "class_name": "Dot", "name": "dot_1", "config": {"axes": -1, "trainable": true, "name": "dot_1", "normalize": false}}, {"inbound_nodes": [[["dense_1", 0, 0, {}], ["flatten_1", 0, 0, {}]]], "class_name": "Dot", "name": "dot_2", "config": {"axes": -1, "trainable": true, "name": "dot_2", "normalize": false}}, {"inbound_nodes": [[["dense_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Dot", "name": "dot_3", "config": {"axes": -1, "trainable": true, "name": "dot_3", "normalize": false}}, {"inbound_nodes": [[["dense_2", 0, 0, {}], ["flatten_1", 0, 0, {}]]], "class_name": "Dot", "name": "dot_4", "config": {"axes": -1, "trainable": true, "name": "dot_4", "normalize": false}}, {"inbound_nodes": [[["dense_2", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Dot", "name": "dot_5", "config": {"axes": -1, "trainable": true, "name": "dot_5", "normalize": false}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}]]], "class_name": "Dot", "name": "dot_6", "config": {"axes": -1, "trainable": true, "name": "dot_6", "normalize": false}}, {"inbound_nodes": [[["input_1", 0, 0, {}], ["input_3", 0, 0, {}], ["dot_1", 0, 0, {}], ["dot_2", 0, 0, {}], ["dot_3", 0, 0, {}], ["dot_4", 0, 0, {}], ["dot_5", 0, 0, {}], ["dot_6", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"inbound_nodes": [[["input_5", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_3", "config": {"input_dim": 6041, "dtype": "int32", "name": "embedding_3", "output_dim": 1, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "trainable": true, "mask_zero": false, "input_length": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "batch_input_shape": [null, 1]}}, {"inbound_nodes": [[["input_6", 0, 0, {}]]], "class_name": "Embedding", "name": "embedding_4", "config": {"input_dim": 3953, "dtype": "int32", "name": "embedding_4", "output_dim": 1, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "trainable": true, "mask_zero": false, "input_length": 1, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "batch_input_shape": [null, 1]}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "units": 1, "activity_regularizer": null, "name": "dense_3", "activation": "linear", "kernel_regularizer": null}}, {"inbound_nodes": [[["embedding_3", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_3", "config": {"trainable": true, "name": "flatten_3"}}, {"inbound_nodes": [[["embedding_4", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_4", "config": {"trainable": true, "name": "flatten_4"}}, {"inbound_nodes": [[["dense_3", 0, 0, {}], ["flatten_3", 0, 0, {}], ["flatten_4", 0, 0, {}]]], "class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}}]}}