{"keras_version": "2.0.4", "backend": "tensorflow", "config": {"name": "model_1", "input_layers": [["mainInput", 0, 0]], "layers": [{"name": "mainInput", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 200], "name": "mainInput", "dtype": "float32"}, "class_name": "InputLayer"}, {"name": "dense_1", "inbound_nodes": [[["mainInput", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "units": 256, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"name": "dropout_1", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"name": "activation_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"name": "dense_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "units": 256, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"name": "activation_2", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"name": "dense_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "units": 128, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"name": "dropout_3", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"name": "dropout_3", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"name": "activation_3", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"name": "dense_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "units": 128, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}, {"name": "dropout_4", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"name": "dropout_4", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"name": "activation_4", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"name": "dense_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_constraint": null, "use_bias": true, "units": 38, "activation": "sigmoid", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_5", "activity_regularizer": null}, "class_name": "Dense"}], "output_layers": [["dense_5", 0, 0]]}, "class_name": "Model"}