{"keras_version": "2.0.3", "config": [{"config": {"filters": 64, "batch_input_shape": [null, 48, 48, 1], "padding": "valid", "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv2d_1", "activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_constraint": null, "axis": 1, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"filters": 64, "padding": "valid", "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv2d_2", "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_constraint": null, "axis": 1, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"filters": 64, "padding": "valid", "bias_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "name": "conv2d_3", "activity_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_constraint": null, "axis": 1, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 512, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.48}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 256, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.48}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "linear", "kernel_regularizer": null, "name": "dense_3", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 7, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "bias_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}