{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.3", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "filters": 64, "bias_regularizer": null, "dilation_rate": [1, 1], "dtype": "float32", "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 48, 48, 1], "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "trainable": true, "use_bias": true, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 1, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "filters": 64, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 1, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "data_format": "channels_last", "bias_constraint": null, "filters": 64, "bias_regularizer": null, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "epsilon": 0.001, "gamma_regularizer": null, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": 1, "center": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.48}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "sigmoid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.48}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "bias_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "softmax"}}]}